# с клавиатуры вводятся числа, ввод завершается числом 0.
# Определить, сколько было введено двузначных натуральных чисел,
# и сколько других.
x=int(input())
a=0
t=0
while (x>0):
    if (9<x<100):
        a+=1
    else: t+=1
    x = int(input())
print(a, t)
#оформить ответ

